app/controllers/api/v1/auth_controller.rb

  def register
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ('Test User', 'test@example.com', '$2a$12$/m.wldsME.YFvE3jcGrKmeQvHXHq6XIRtcWbjN859gAlpMdrHvGme', '2025-08-07 14:26:47.306448', '2025-08-07 14:26:47.306448') RETURNING "id"

  def login
    user = User.find_by(email: params[:email]&.downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'alice@example.com' LIMIT 1