app/controllers/api/v1/polls_controller.rb

SELECT "options".* FROM "options" WHERE "options"."poll_id" IN (3, 2, 1)
SELECT "polls".* FROM "polls" WHERE "polls"."active" = TRUE AND (expires_at > '2025-08-07 14:26:47.906027') ORDER BY "polls"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (3, 2, 1)
SELECT "votes".* FROM "votes" WHERE "votes"."option_id" IN (11, 12, 13, 14, 15, 16)
SELECT "votes".* FROM "votes" WHERE "votes"."poll_id" IN (3, 2, 1)
---
  def index
    polls = Poll.includes(:user, :options, :votes)
               .active
               .not_expired
               .order(created_at: :desc)

    render json: {
      polls: polls.map { |poll| poll_response(poll) }

INSERT INTO "polls" ("title", "description", "user_id", "active", "expires_at", "created_at", "updated_at") VALUES ('What is your favorite IDE?', 'Choose your preferred integrated development environment', 1, TRUE, '2025-08-14 14:00:00', '2025-08-07 14:26:48.592166', '2025-08-07 14:26:48.592166') RETURNING "id"
SELECT "options".* FROM "options" WHERE "options"."poll_id" = 4
INSERT INTO "options" ("text", "poll_id", "votes_count", "created_at", "updated_at") VALUES ('VS Code', 4, 0, '2025-08-07 14:26:48.623876', '2025-08-07 14:26:48.623876') RETURNING "id"
---
  def create
    poll = current_user.polls.build(poll_params)

    if poll.save
      # Create options if provided
      if params[:options].present?
        options_data = params[:options].map do |option_text|
          { text: option_text, poll: poll }
        end

        poll.options.create!(options_data)

SELECT "options".* FROM "options" WHERE "options"."poll_id" IN (4, 1)
SELECT "polls".* FROM "polls" WHERE "polls"."user_id" = 1 ORDER BY "polls"."created_at" DESC
SELECT "votes".* FROM "votes" WHERE "votes"."option_id" IN (17, 18, 19, 20)
SELECT "votes".* FROM "votes" WHERE "votes"."poll_id" IN (4, 1)
---
  def my_polls
    polls = current_user.polls.includes(:options, :votes).order(created_at: :desc)
    render json: {
      polls: polls.map { |poll| poll_response(poll) }

SELECT "polls".* FROM "polls" WHERE "polls"."id" = 4 LIMIT 1
---
  def set_poll
    @poll = Poll.find(params[:id])

SELECT "options".* FROM "options" WHERE "options"."poll_id" = 4
---
  def poll_response(poll)
    {
      id: poll.id,
      title: poll.title,
      description: poll.description,
      active: poll.active,
      expires_at: poll.expires_at,
      expired: poll.expired?,
      total_votes: poll.total_votes,
      created_at: poll.created_at,
      updated_at: poll.updated_at,
      user: {
        id: poll.user.id,
        name: poll.user.name
      },
      options: poll.options.map do |option|