app/controllers/api/v1/votes_controller.rb

  def create
    # Check if user already voted on this poll
    existing_vote = current_user.votes.find_by(poll: @poll)

    if existing_vote
      return render json: { error: "You have already voted on this poll" }, status: :unprocessable_entity
    end

    # Check if poll is active and not expired
    if !@poll.active? || @poll.expired?
      return render json: { error: "Poll is not active or has expired" }, status: :unprocessable_entity
    end

    vote = current_user.votes.build(
      poll: @poll,
      option: @option
    )

    if vote.save
---
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = 1 AND "votes"."poll_id" = 6 LIMIT 1
INSERT INTO "votes" ("user_id", "option_id", "poll_id", "created_at", "updated_at") VALUES (1, 25, 6, '2025-08-07 15:06:00.097928', '2025-08-07 15:06:00.097928') RETURNING "id"

  def set_poll
    @poll = Poll.find(params[:poll_id])
---
SELECT "polls".* FROM "polls" WHERE "polls"."id" = 4 LIMIT 1

  def set_option
    @option = @poll.options.find(params[:vote][:option_id] || params[:option_id])
---
SELECT "votes".* FROM "votes" WHERE "votes"."option_id" IN (26, 27, 28, 25)
SELECT "options".* FROM "options" WHERE "options"."poll_id" = 4 AND "options"."id" = 1 LIMIT 1

  def poll_response(poll)
    {
      id: poll.id,
      title: poll.title,
      description: poll.description,
      active: poll.active,
      expires_at: poll.expires_at,
      expired: poll.expired?,
      total_votes: poll.total_votes,
      created_at: poll.created_at,
      updated_at: poll.updated_at,
      user: {
        id: poll.user.id,
        name: poll.user.name
      },
      options: poll.options.map do |option|
---
SELECT "options".* FROM "options" WHERE "options"."poll_id" = 6