app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def authenticate_user
    token = request.headers["Authorization"]&.split(" ")&.last

    return render json: { error: "No token provided" }, status: :unauthorized unless token

    begin
      decoded_token = JWT.decode(token, Rails.application.secret_key_base, true, { algorithm: "HS256" })
      user_id = decoded_token.first["user_id"]
      @current_user = User.find(user_id)