app/models/option.rb

SELECT COUNT(*) FROM "votes" WHERE "votes"."option_id" = 11
---
  def vote_percentage
    total_votes = poll.total_votes
    return 0 if total_votes.zero?

    (votes.count.to_f / total_votes * 100).round(2)