app/models/poll.rb

  def results
    options.includes(:votes).map do |option|
      {
        id: option.id,
        text: option.text,
        votes_count: option.votes.count,
        percentage: total_votes > 0 ? (option.votes.count.to_f / total_votes * 100).round(2) : 0
---
SELECT "votes".* FROM "votes" WHERE "votes"."option_id" IN (11, 12, 13, 14, 15, 16)
SELECT COUNT(*) FROM "votes" WHERE "votes"."option_id" = 11