app/models/vote.rb

SELECT COUNT(*) FROM "votes" WHERE "votes"."option_id" = 2
UPDATE "options" SET "votes_count" = 1 WHERE "options"."id" = 2
---
  def update_option_votes_count
    option.update_column(:votes_count, option.votes.count)